RossBerry/TM4C123GH6PM-nRF24L01/nrf24l01.cpp
/*
  Copyright (C) 2020 Kenneth Berry <rosskberry@gmail.com>

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.
*/

#include <stdint.h>
#include <string.h>
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "inc/hw_memmap.h"
#include "driverlib/pin_map.h"
#include "driverlib/ssi.h"
#include "driverlib/sysctl.h"
#include "utils/uartstdio.h"
#include "nrf24l01.h"
#include "nrf24_utils.h"

/********* Constants *********/

static const char CRC_LENGTH_0[] = "Disabled";
static const char CRC_LENGTH_1[] = "8 bits";
static const char CRC_LENGTH_2[] = "16 bits" ;
static const char * const CRC_LENGTHS[] =
{
    CRC_LENGTH_0,
    CRC_LENGTH_1,
    CRC_LENGTH_2,
};

static const char DATA_RATE_0[] = "1MBPS";
static const char DATA_RATE_1[] = "2MBPS";
static const char DATA_RATE_2[] = "250KBPS";
static const char * const DATA_RATES[] =
{
    DATA_RATE_0,
    DATA_RATE_1,
    DATA_RATE_2,
};

static const char MODEL_0[] = "nRF24L01";
static const char MODEL_1[] = "nRF24L01+";
static const char * const MODELS[] =
{
    MODEL_0,
    MODEL_1,
};

static const char PA_SETTING_0[] = "PA_MIN";
static const char PA_SETTING_1[] = "PA_LOW";
static const char PA_SETTING_2[] = "LA_MED";
static const char PA_SETTING_3[] = "PA_HIGH";
static const char * const PA_SETTINGS[] =
{
    PA_SETTING_0,
    PA_SETTING_1,
    PA_SETTING_2,
    PA_SETTING_3,
};

static const uint8_t CHILD_PIPE[] =
{
    RX_ADDR_P0,
    RX_ADDR_P1,
    RX_ADDR_P2,
    RX_ADDR_P3,
    RX_ADDR_P4,
    RX_ADDR_P5
};

static const uint8_t CHILD_PAYLOAD_SIZE[] =
{
    RX_PW_P0,
    RX_PW_P1,
    RX_PW_P2,
    RX_PW_P3,
    RX_PW_P4,
    RX_PW_P5
};

static const uint8_t CHILD_PIPE_ENABLE[] =
{
    ERX_P0,
    ERX_P1,
    ERX_P2,
    ERX_P3,
    ERX_P4,
    ERX_P5
};

/********* Protected Member Functions *********/

/**
 * Empty the receive buffer
 *
 * @return Current value of status register
 */
uint8_t NRF24L01::flush_rx(void)
{
    uint8_t status;

    set_csn(LOW);
    status = spi_transfer(FLUSH_RX);
    set_csn(HIGH);

    return status;
}

/**
 * Empty the transmit buffer
 *
 * @return Current value of status register
 */
uint8_t NRF24L01::flush_tx(void)
{
    uint8_t status;

    set_csn(LOW);
    status = spi_transfer(FLUSH_TX);
    set_csn(HIGH);

    return status;
}

/**
 * Retrieve the current status of the nRF24 chip
 *
 * @return Current value of status register
 */
uint8_t NRF24L01::get_chip_status(void)
{
    uint8_t chip_status;

    set_csn(LOW);
    chip_status = spi_transfer(NOP);
    set_csn(HIGH);

    return chip_status;
}

/**
 * Enable control pins.
 */
void NRF24L01::init_pins(void)
{
    // Enable SSI peripheral
    SysCtlPeripheralEnable(spi_periph);

    uint32_t data_rx;

    // Enable GPIO peripheral and Configure pin muxing for SPI pins
    if (spi_periph == SYSCTL_PERIPH_SSI0)
    {
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
        GPIOPinConfigure(GPIO_PA2_SSI0CLK);
        GPIOPinConfigure(GPIO_PA3_SSI0FSS);
        GPIOPinConfigure(GPIO_PA4_SSI0RX);
        GPIOPinConfigure(GPIO_PA5_SSI0TX);
        GPIOPinTypeSSI(GPIO_PORTA_BASE,
                           GPIO_PIN_5 | GPIO_PIN_4 | GPIO_PIN_3 | GPIO_PIN_2);
        ssi_base = SSI0_BASE;
    }
    else if (spi_periph == SYSCTL_PERIPH_SSI1)
    {
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        GPIOPinConfigure(GPIO_PF2_SSI1CLK);
        GPIOPinConfigure(GPIO_PF3_SSI1FSS);
        GPIOPinConfigure(GPIO_PF0_SSI1RX);
        GPIOPinConfigure(GPIO_PF1_SSI1TX);
        GPIOPinTypeSSI(GPIO_PORTF_BASE,
                           GPIO_PIN_1 | GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_2);
        ssi_base = SSI1_BASE;
    }
    else if (spi_periph == SYSCTL_PERIPH_SSI2)
    {
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
        GPIOPinConfigure(GPIO_PB4_SSI2CLK);
        GPIOPinConfigure(GPIO_PB5_SSI2FSS);
        GPIOPinConfigure(GPIO_PB6_SSI2RX);
        GPIOPinConfigure(GPIO_PB7_SSI2TX);
        GPIOPinTypeSSI(GPIO_PORTB_BASE,
                           GPIO_PIN_7 | GPIO_PIN_6 | GPIO_PIN_5 | GPIO_PIN_4);
        ssi_base = SSI2_BASE;
    }
    else if (spi_periph == SYSCTL_PERIPH_SSI3)
    {
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        GPIOPinConfigure(GPIO_PD0_SSI3CLK);
        GPIOPinConfigure(GPIO_PD1_SSI3FSS);
        GPIOPinConfigure(GPIO_PD2_SSI3RX);
        GPIOPinConfigure(GPIO_PD3_SSI3TX);
        GPIOPinTypeSSI(GPIO_PORTD_BASE,
                           GPIO_PIN_3 | GPIO_PIN_2 | GPIO_PIN_1 | GPIO_PIN_0);
        ssi_base = SSI3_BASE;
    }

    // Configure and enable the SSI port for TI master mode.  Use SSI0, system
    // clock supply, master mode, 1MHz SSI frequency, and 8-bit data.
    //
    SSIConfigSetExpClk(ssi_base, SysCtlClockGet(), SSI_FRF_MOTO_MODE_0,
                       SSI_MODE_MASTER, 1000000, 8);

    // Enable the SSI module.
    SSIEnable(ssi_base);

    // Read any residual data from the SSI port.  This makes sure the receive
    // FIFOs are empty, so we don't read any unwanted junk.  This is done here
    // because the TI SSI mode is full-duplex, which allows you to send and
    // receive at the same time.  The SSIDataGetNonBlocking function returns
    // "true" when data was returned, and "false" when no data was returned.
    // The "non-blocking" function checks if there is any data in the receive
    // FIFO and does not "hang" if there isn't.
    //
    while(SSIDataGetNonBlocking(ssi_base, &data_rx)) {}

    // Enable the GPIO ports for CE and CSN pins
    SysCtlPeripheralEnable(ce_periph);
    SysCtlPeripheralEnable(csn_periph);

    // Enable the GPIO pins for the CE and CSN pins
    GPIOPinTypeGPIOOutput(ce_pin_base, ce_pin);
    GPIOPinTypeGPIOOutput(csn_pin_base, csn_pin);
}

/**
 * Print the name and value of a 40-bit address register to UART
 *
 * @param name Name of the register
 * @param reg Which register. Use constants from nRF24L01.h
 * @param qty How many successive registers to print
 *
 * @warning Does nothing if uart_enabled is false.
 */
void NRF24L01::print_address_register(const char* name, uint8_t reg, uint8_t qty)
{
    if (uart_enabled)
    {
        char extra_tab = strlen(name) < 8 ? '\t' : 0;
        UARTprintf("%s\t%c =", name, extra_tab);
        while (qty--)
        {
            uint8_t buffer[5];
            read_register(reg++, buffer, sizeof buffer);

            UARTprintf(" 0x");
            uint8_t* bufptr = buffer + sizeof buffer;
            while (--bufptr >= buffer)
            {
                UARTprintf("%02x", *bufptr);
            }
        }
        UARTprintf("\r\n");
    }
}

/**
 * Print the name and value of an 8-bit register to UART
 *
 * @param name Name of the register
 * @param reg Which register. Use constants from nRF24L01.h
 * @param qty How many successive registers to print
 *
 * @warning Does nothing if uart_enabled is false.
 */
void NRF24L01::print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
    if (uart_enabled)
    {
        char extra_tab = strlen(name) < 8 ? '\t' : 0;
        UARTprintf("%s\t%c =", name, extra_tab);
        while (qty--)
        {
            UARTprintf(" 0x%02x", read_register(reg++));
        }
        UARTprintf("\r\n");
    }
}

/**
 * Decode and print the given status to UART
 *
 * @param chip_status Status value to print
 *
 * @warning Does nothing if uart_enabled is false.
 */
void NRF24L01::print_chip_status(uint8_t chip_status)
{
    if (uart_enabled)
    {
        UARTprintf("STATUS\t\t = 0x%02x RX_DR=%x TX_DS=%x MAX_RT=%x RX_P_NO=%x TX_FULL=%x\r\n",
                   chip_status,
                   (chip_status & (1 << RX_DR)) ? 1 : 0,
                   (chip_status & (1 << TX_DS)) ? 1 : 0,
                   (chip_status & (1 << MAX_RT)) ? 1 : 0,
                   ((chip_status >> RX_P_NO) & 0x7),
                   (chip_status & (1 << TX_FULL)) ? 1 : 0);
    }
}

/**
 * Decode and print the given 'observe_tx' value to UART
 *
 * @param value The observe_tx value to print
 *
 * @warning Does nothing if uart_enabled is false.
 */
void NRF24L01::print_observe_tx(uint8_t value)
{
    if (uart_enabled)
    {
        UARTprintf("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n",
                 value,
                 (value >> PLOS_CNT) & 0xF,
                 (value >> ARC_CNT) & 0xF);
    }
}

/**
 * Read the receive payload
 *
 * The size of data read is the fixed payload size, see get_payload_size()
 *
 * @param buf Where to put the data
 * @param len Maximum number of bytes to read
 * @return Current value of status register
 */
uint8_t NRF24L01::read_payload(void* buf, uint8_t len)
{
    uint8_t status;
    uint8_t* current = reinterpret_cast<uint8_t*>(buf);
    uint8_t data_len = min(len,payload_size);
    uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

