RossBerry/TM4C123GH6PM-nRF24L01/nrf24l01.cpp
    set_csn(LOW);
    status = spi_transfer(R_RX_PAYLOAD);
    while (data_len--)
    {
        *current++ = spi_transfer(0xff);
    }
    while (blank_len--)
    {
        spi_transfer(0xff);
    }
    set_csn(HIGH);

    return status;
}

/**
 * Read single byte from a register
 *
 * @param reg Which register.
 * @return Current value of register @p reg
 */
uint8_t NRF24L01::read_register(uint8_t reg)
{
    set_csn(LOW);
    spi_transfer(R_REGISTER | (REGISTER_MASK & reg));
    uint8_t result = spi_transfer(0xff);
    set_csn(HIGH);

    return result;
}

/**
 * Read a chunk of data in from a register
 *
 * @param reg Which register.
 * @param buf Where to put the data
 * @param len How many bytes of data to transfer
 * @return Current value of status register
 */
uint8_t NRF24L01::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
    uint8_t status;

    set_csn(LOW);
    status = spi_transfer(R_REGISTER | (REGISTER_MASK & reg));
    while (len--)
    {
        *buf++ = spi_transfer(0xff);
    }
    set_csn(HIGH);

    return status;
}

/**
 * Set chip enable
 *
 * @param level HIGH to actively begin transmission or LOW to put in standby.
 */
void NRF24L01::set_ce(int level)
{
    GPIOPinWrite(ce_pin_base, ce_pin, (level ? ce_pin : 0));
}

/**
 * Set chip select pin
 *
 * @param mode HIGH to take this unit off the SPI bus, LOW to put it on
 */
void NRF24L01::set_csn(int mode)
{
    // Minimum ideal SPI bus speed is 2x data rate
    // If we assume 2Mbs data rate and 16Mhz clock, a
    // divider of 4 is the minimum we want.
    // CLK:BUS 8Mhz:2Mhz, 16Mhz:4Mhz, or 20Mhz:5Mhz
    GPIOPinWrite(csn_pin_base, csn_pin, (mode ? csn_pin : 0));
}

/**
 * Transfer data to and from nRF24 chip via SPI
 *
 * @param data The data to send to chip over SPI
 * @return The data received from the chip over SPI
 */
uint32_t NRF24L01::spi_transfer(uint32_t data)
{
    SSIDataPut(ssi_base, data);

    if(!SSIDataGetNonBlocking(ssi_base, &data))
    {
        SSIDataGet(ssi_base, &data);
    }

    return data & 0xFF;
}

/**
 * Turn on or off the special features of the nRF24 chip
 *
 * The chip has certain features which are only available when the features
 * are enabled.  See the datasheet for details.
 */
void NRF24L01::toggle_features(void)
{
    set_csn(LOW);
    spi_transfer(ACTIVATE);
    spi_transfer(0x73);
    set_csn(HIGH);
}

/**
 * Write the transmit payload
 *
 * The size of data written is the fixed payload size, see get_payload_size()
 *
 * @param buf Where to get the data
 * @param len Number of bytes to be sent
 * @return Current value of status register
 */
uint8_t NRF24L01::write_payload(const void* buf, uint8_t len)
{
    uint8_t status;
    const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);
    uint8_t data_len = min(len,payload_size);
    uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

    set_csn(LOW);
    status = spi_transfer(W_TX_PAYLOAD);
    while (data_len--)
    {
        spi_transfer(*current++);
    }
    while (blank_len--)
    {
        spi_transfer(0);
    }
    set_csn(HIGH);

    return status;
}

/**
 * Write a single byte to a register
 *
 * @param reg Which register.
 * @param value The new value to write
 * @return Current value of status register
 */
uint8_t NRF24L01::write_register(uint8_t reg, uint8_t value)
{
    uint8_t status;

    set_csn(LOW);
    status = spi_transfer(W_REGISTER | (REGISTER_MASK & reg));
    spi_transfer(value);
    set_csn(HIGH);

    return status;
}

/**
 * Write a chunk of data to a register
 *
 * @param reg Which register.
 * @param buf Where to get the data
 * @param len How many bytes of data to transfer
 * @return Current value of status register
 */
uint8_t NRF24L01::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
    uint8_t status;

    set_csn(LOW);
    status = spi_transfer(W_REGISTER | (REGISTER_MASK & reg));
    while (len--)
    {
        spi_transfer(*buf++);
    }
    set_csn(HIGH);

    return status;
}

/********* Public Member Functions *********/

/**
 * NRF24L01 Constructor
 *
 * @param _ce_periph The peripheral to enable
 * @param _ce_pin_base The base address of the GPIO port
 * @param _ce_pin The pin attached to Chip Enable on the RF module
 * @oaran _csn_periph The peripheral to enable
 * @param _csn_pin_base The base address of the GPIO port
 * @param _csn_pin The pin attached to Chip Select
 * @param _spi_periph The SPI/SSI peripheral pins to enable (SPI0-SPI3)
 */
NRF24L01::NRF24L01(uint32_t _ce_periph, uint32_t _ce_pin_base, uint8_t _ce_pin,
             uint32_t _csn_periph, uint32_t _csn_pin_base, uint8_t _csn_pin,
             uint32_t _spi_periph)
	         : ce_periph(_ce_periph),
	           ce_pin_base(_ce_pin_base),
	           ce_pin(_ce_pin),
	           csn_periph(_csn_periph),
	           csn_pin_base(_csn_pin_base),
	           csn_pin(_csn_pin),
	           spi_periph(_spi_periph),
	           wide_band(true),
	           p_variant(false),
	           payload_size(32),
	           ack_payload_available(false),
	           dynamic_payloads_enabled(false),
	           pipe0_reading_address(0) {}

/**
 * Test whether there are bytes available to be read
 *
 * @return True if there is a payload available, false if none
 */
bool NRF24L01::available(void)
{
    return available(NULL);
}

/**
 * Test whether there are bytes available to be read
 *
 * Use this function to discover on which pipe the message
 * arrived.
 *
 * @param[out] pipe_num Which pipe has the payload available
 * @return True if there is a payload available, false if none is
 */
bool NRF24L01::available(uint8_t* pipe_num)
{
    uint8_t chip_status = get_chip_status();


    bool result = (chip_status & (1 << RX_DR));

    if (result)
    {
        // Include pipe number if it exists
        if (pipe_num)
        {
            *pipe_num = (chip_status >> RX_P_NO) & 0x7;
        }

        // Handle ack payload receipt
        if (chip_status & (1 << TX_DS))
        {
            write_register(STATUS, (1 << TX_DS));
        }
    }

    return result;
}

/**
 * Begin operation of the chip
 *
 * @warning Call this before calling any other methods.
 */
void NRF24L01::begin(void)
{
    // Enable lazy stacking for interrupt handlers.  This allows floating-point
    // instructions to be used within interrupt handlers, but at the expense of
    // extra stack usage.
    FPULazyStackingEnable();

    init_pins();

