RossBerry/TM4C123GH6PM-nRF24L01/nrf24l01.cpp
    set_ce(LOW);
    set_csn(HIGH);

    // Must allow the radio time to settle else configuration bits may not bet set.
    // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
    // 4.5ms + 14us is required, but delay for 5ms for good measure.
    // WARNING: Delay is based on P-variant whereby non-P *may* require different timing.
    delay_milliseconds(5);

    // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts.
    // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
    // sizes must never be used. See datasheet for a more complete explanation.
    write_register(SETUP_RETR, (0x4 << ARD) | (0xF << ARC));

    // Restore default PA level
    set_pa_level(NRF24L01_PA_MAX);

    // Determine if this is a p or non-p RF24 module and then
    // reset data rate back to default value. This works
    // because a non-P variant won't allow the data rate to
    // be set to 250Kbps.
    if (set_data_rate(NRF24L01_250KBPS))
    {
        p_variant = true;
    }

    // Set the data rate to the slowest (and most reliable) speed supported by
    // P-variant and non-P models.
    set_data_rate(NRF24L01_1MBPS);

    // Initialize CRC and request 2-byte (16bit) CRC
    set_crc_length(NRF24L01_CRC_16);

    // Disable dynamic payloads, to match dynamic_payloads_enabled setting
    write_register(DYNPD, 0);

    // Reset current status
    write_register(STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));

    // Set default channel configuration.
    set_channel(76);

    // Flush buffers
    flush_rx();
    flush_tx();
}

/**
 * Disable CRC validation
 *
 */
void NRF24L01::disable_crc(void)
{
    uint8_t disable = read_register(CONFIG) & ~(1 << EN_CRC);
    write_register(CONFIG, disable);
}

/**
 * Enable custom payloads on the acknowledge packets
 *
 * Ack payloads are a handy way to return data back to senders without
 * manually changing the radio modes on both units.
 */
void NRF24L01::enable_ack_payload(void)
{
    // Enable ack payload and dynamic payload features
    write_register(FEATURE, read_register(FEATURE) | (1 << EN_ACK_PAY) | (1 << EN_DPL));

    // Check if features are enabled
    if (!read_register(FEATURE))
    {
        // Enable features and try again
        toggle_features();
        write_register(FEATURE, read_register(FEATURE) | (1 << EN_ACK_PAY) | (1 << EN_DPL) );
    }

    // Enable dynamic payload on pipes 0 and 1
    write_register(DYNPD, read_register(DYNPD) | (1 << DPL_P1) | (1 << DPL_P0));
}

/**
 * Enable dynamically-sized payloads
 *
 * This way you don't always have to send large packets.
 *
 * @warning This enables dynamic payloads on ALL pipes.
 */
void NRF24L01::enable_dynamic_payloads(void)
{
    // Enable dynamic payload
    write_register(FEATURE,read_register(FEATURE) | (1 << EN_DPL));

    // Check if feature is enabled
    if (!read_register(FEATURE))
    {
        // Enable features and try again
        toggle_features();
        write_register(FEATURE, read_register(FEATURE) | (1 << EN_DPL));
    }

    // Enable dynamic payload on all pipes.
    write_register(DYNPD,
                   read_register(DYNPD)
                   | (1 << DPL_P5)
                   | (1 << DPL_P4)
                   | (1 << DPL_P3)
                   | (1 << DPL_P2)
                   | (1 << DPL_P1)
                   | (1 << DPL_P0));
    dynamic_payloads_enabled = true;
}

/**
 * Get the CRC length
 *
 * @return NRF24L01_DISABLED if disabled or NRF24L01_CRC_8 for 8-bit or NRF24L01_CRC_16 for 16-bit
 */
nrf24l01_crc_length NRF24L01::get_crc_length(void)
{
    nrf24l01_crc_length result = NRF24L01_CRC_DISABLED;
    uint8_t config = read_register(CONFIG) & ((1 << CRCO) | (1 << EN_CRC));

    if (config & (1 << EN_CRC ))
    {
        if (config & (1 << CRCO))
        {
            result = NRF24L01_CRC_16;
        }
        else
        {
            result = NRF24L01_CRC_8;
        }
    }

    return result;
}

/**
 * Fetches the transmission data rate
 *
 * @return Returns the hardware's currently configured data rate. The value
 * is either 250kbs, NRF24L01_1MBPS for 1Mbps, or NRF24L01_2MBPS; as defined in the
 * nrf24l01_data_rate enum.
 */
nrf24l01_data_rate NRF24L01::get_data_rate(void)
{
    nrf24l01_data_rate result ;
    uint8_t data_rate = read_register(RF_SETUP) & ((1 << RF_DR_LOW) | (1 << RF_DR_HIGH));

    if (data_rate == (1 << RF_DR_LOW))
    {
        // '10' = 250KBPS
        result = NRF24L01_250KBPS;
    }
    else if (data_rate == (1 << RF_DR_HIGH))
    {
        // '01' = 2MBPS
        result = NRF24L01_2MBPS;
    }
    else
    {
        // '00' = 1MBPS
        result = NRF24L01_1MBPS;
    }

    return result;
}

/**
 * Get Dynamic Payload Size
 *
 * For dynamic payloads, this pulls the size of the payload off
 * the chip
 *
 * @return Payload length of last-received dynamic payload
 */
uint8_t NRF24L01::get_dynamic_payload_size(void)
{
    uint8_t result = 0;

    set_csn(LOW);
    spi_transfer(R_RX_PL_WID);
    result = spi_transfer(0xff);
    set_csn(HIGH);

    return result;
}

/**
 * Fetches the current PA level.
 *
 * @return Returns a value from the nrf24l01_pa_dbm enum describing
 * the current PA setting. Please remember, all values represented
 * by the enum mnemonics are negative dBm. See set_pa_level() for
 * return value descriptions.
 */
nrf24l01_pa_dbm NRF24L01::get_pa_level(void)
{
    nrf24l01_pa_dbm result = NRF24L01_PA_ERROR;
    uint8_t power = read_register(RF_SETUP) & ((1 << RF_PWR_LOW) | (1 << RF_PWR_HIGH));

    if (power == ((1 << RF_PWR_LOW) | (1 << RF_PWR_HIGH)))
    {
        result = NRF24L01_PA_MAX;
    }
    else if (power == (1 << RF_PWR_HIGH))
    {
        result = NRF24L01_PA_HIGH;
    }
    else if (power == (1 << RF_PWR_LOW))
    {
        result = NRF24L01_PA_LOW;
    }
    else
    {
        result = NRF24L01_PA_MIN;
    }

    return result;
}

/**
 * Get Static Payload Size
 *
 * @see set_payload_size()
 *
 * @return The number of bytes in the payload
 */
uint8_t NRF24L01::get_payload_size(void)
{
    return payload_size;
}

/**
 * Determine if an ack payload was received in the most recent call to
 * write().
 *
 * Call read() to retrieve the ack payload.
 *
 * @return True if an ack payload is available.
 */
bool NRF24L01::is_ack_payload_available(void)
{
    bool result = ack_payload_available;
    ack_payload_available = false;

    return result;
}

/**
 * Determine whether the hardware is listening or not.
 *
 * @return true if the hardware is listening and false if its not.
 */
bool NRF24L01::is_listening(void)
{
    return listening;
}

/**
 * Determine whether the hardware is an nRF24L01+ or not.
 *
 * @return true if the hardware is nRF24L01+ (or compatible) and false
 * if its not.
 */
bool NRF24L01::is_p_variant(void)
{
    return p_variant;
}

/**
 * Open a pipe for reading
 *
 * Up to 6 pipes can be open for reading at once.  Open all
 * reading pipes, and then call start_listening().
 *
 * @see open_writing_pipe()
 *
 * @warning Pipes 1-5 should share the first 32 bits.
 * Only the least significant byte should be unique, e.g.
 * @code
 *   open_reading_pipe(1, 0xF0F0F0F0AA);
 *   open_reading_pipe(2, 0xF0F0F0F066);
 * @endcode
 *
 * @warning Pipe 0 is also used by the writing pipe.  So if you open
 * pipe 0 for reading, and then start_listening(), it will overwrite the
 * writing pipe.
 *
 * @TODO Enforce the restriction that pipes 1-5 must share the top 32 bits
 *
 * @param child Which pipe# to open, 0-5.
 * @param address The 40-bit address of the pipe to open.
 */
void NRF24L01::open_reading_pipe(uint8_t child, uint64_t address)
{
    // If this is pipe 0, cache the address.  This is needed because
    // open_writing_pipe() will overwrite the pipe 0 address, so
    // start_listening() will have to restore it.
    if (child == 0)
    {
        pipe0_reading_address = address;
    }
    if (child <= 6)
    {
        // For pipes 2-5, only write the LSB
        if ( child < 2 )
        {
            write_register(*(&CHILD_PIPE[child]), reinterpret_cast<const uint8_t*>(&address), 5);
        }
        else
        {
            write_register(*(&CHILD_PIPE[child]), reinterpret_cast<const uint8_t*>(&address), 1);
        }
        write_register(*(&CHILD_PAYLOAD_SIZE[child]),payload_size);

        // Set bits for open pipes
        write_register(EN_RXADDR, read_register(EN_RXADDR) | (1 << *(&CHILD_PIPE_ENABLE[child])));
    }
}

/**
 * Open a pipe for writing
 *
 * Only one pipe can be open at once, but you can change the pipe
 * you'll listen to.  Do not call this while actively listening, and
 * remember to stop_listening() first.
 *
 * Addresses are 40-bit hex values, e.g.:
 * @code
 *   open_writing_pipe(0xF0F0F0F0F0);
 * @endcode
 *
 * @param address The 40-bit address of the pipe to open.  This can be
 * any value whatsoever, as long as you are the only one writing to it
 * and only one other radio is listening to it.  Coordinate these pipe
 * addresses amongst nodes on the network.
 */
void NRF24L01::open_writing_pipe(uint64_t address)
{
    write_register(RX_ADDR_P0, reinterpret_cast<uint8_t*>(&address), 5);
    write_register(TX_ADDR, reinterpret_cast<uint8_t*>(&address), 5);

    const uint8_t max_payload_size = 32;
    write_register(RX_PW_P0,min(payload_size, max_payload_size));
}

/**
 * Enter low-power mode
 *
 * To return to normal power mode, either write() some data or
 * start_listening(), or power_up().
 */
void NRF24L01::power_down(void)
{
    write_register(CONFIG, read_register(CONFIG) & ~(1 << PWR_UP));
}

/**
 * Leave low-power mode - making radio more responsive
 *
 * To return to low power mode, call power_down().
 */
void NRF24L01::power_up(void)
{
    write_register(CONFIG, read_register(CONFIG) | (1 << PWR_UP));
}

/**
 * Print debugging information to UART
 *
 * @warning Does nothing if uart_enabled false.
 */
void NRF24L01::print_details(void)
{
    if (uart_enabled)
    {
        print_chip_status(get_chip_status());

        print_address_register("RX_ADDR_P0-1", RX_ADDR_P0, 2);
        print_byte_register("RX_ADDR_P2-5", RX_ADDR_P2, 4);
        print_address_register("TX_ADDR", TX_ADDR);

