RossBerry/TM4C123GH6PM-nRF24L01/nrf24l01.cpp
        print_byte_register("RX_PW_P0-6", RX_PW_P0, 6);
        print_byte_register("EN_AA", EN_AA);
        print_byte_register("EN_RXADDR", EN_RXADDR);
        print_byte_register("RF_CH", RF_CH);
        print_byte_register("RF_SETUP", RF_SETUP);
        print_byte_register("CONFIG", CONFIG);
        print_byte_register("DYNPD/FEATURE", DYNPD, 2);

        UARTprintf("Data Rate\t = %s\r\n", *(&DATA_RATES[get_data_rate()]));
        UARTprintf("Model\t\t = %s\r\n", *(&MODELS[is_p_variant()]));
        UARTprintf("CRC Length\t = %s\r\n", *(&CRC_LENGTHS[get_crc_length()]));
        UARTprintf("PA Power\t = %s\r\n", *(&PA_SETTINGS[get_pa_level()]));
    }
}

/**
 * Read the payload
 *
 * Return the last payload received
 *
 * The size of data read is the fixed payload size, see get_payload_size()
 *
 * @param buf Pointer to a buffer where the data should be written
 * @param len Maximum number of bytes to read into the buffer
 * @return True if the payload was delivered successfully false if not
 */
bool NRF24L01::read(void* buf, uint8_t len)
{
    // Fetch the payload
    read_payload(buf, len);

    uint8_t chip_status = get_chip_status();

    // Clear the status bit
    write_register(STATUS, (1 << RX_DR));

    return read_register(FIFO_STATUS) & (1 << RX_EMPTY);
}

/**
 * Enable or disable auto-acknowlede packets
 *
 * This is enabled by default, so it's only needed if you want to turn
 * it off for some reason.
 *
 * @param enable Whether to enable (true) or disable (false)
 */
void NRF24L01::set_auto_ack(bool enable)
{
    if (enable)
    {
        write_register(EN_AA, 0x3F);
    }
    else
    {
        write_register(EN_AA, 0);
    }
}

/**
 * Enable or disable auto-acknowlede packets on a per pipeline basis.
 *
 * Auto-acknowlede is enabled by default, so it's only needed if you want
 * to turn it off/on for some reason on a per pipeline basis.
 *
 * @param pipe Which pipeline to modify
 * @param enable Whether to enable (true) or disable (false) auto-acks
 */
void NRF24L01::set_auto_ack(uint8_t pipe, bool enable)
{
    if (pipe <= 6)
    {
        uint8_t en_aa = read_register(EN_AA);
        if(enable)
        {
            en_aa |= (1 << pipe);
        }
        else
        {
            en_aa &= ~(1 << pipe);
        }
        write_register(EN_AA, en_aa);
    }
}

/**
 * Set RF communication channel
 *
 * @param channel Which RF channel to communicate on, 0-127
 */
void NRF24L01::set_channel(uint8_t channel)
{
    // TODO: This method could take advantage of the 'wide_band' calculation
    // done in set_channel() to require certain channel spacing.
    const uint8_t max_channel = 127;
    write_register(RF_CH, min(channel, max_channel));
}

/**
 * Set the CRC length
 *
 * @param length NRF24L01_CRC_8 for 8-bit or NRF24L01_CRC_16 for 16-bit
 */
void NRF24L01::set_crc_length(nrf24l01_crc_length length)
{
    uint8_t config = read_register(CONFIG) & ~((1 << CRCO) | (1 << EN_CRC));

    if (length == NRF24L01_CRC_DISABLED)
    {
        // Do nothing
    }
    else if (length == NRF24L01_CRC_8)
    {
        config |= (1 << EN_CRC);
    }
    else
    {
        config |= (1 << EN_CRC);
        config |= (1 << CRCO);
    }
    write_register(CONFIG, config);
}

/**
 * Set the transmission data rate
 *
 * @warning setting NRF24L01_250KBPS will fail for nRF24L01
 *
 * @param speed NRF24L01_250KBPS for 250kbs, NRF24L01_1MBPS for 1Mbps, or NRF24L01_2MBPS for 2Mbps
 * @return true if the change was successful
 */
bool NRF24L01::set_data_rate(nrf24l01_data_rate speed)
{
    bool result = false;
    uint8_t setup = read_register(RF_SETUP);

    wide_band = false ;
    setup &= ~((1 << RF_DR_LOW) | (1 << RF_DR_HIGH));
    if(speed == NRF24L01_250KBPS)
    {
        // Set the RF_DR_LOW to 1 (250 Kbs)
        wide_band = false ;
        setup |= (1 << RF_DR_LOW);
    }
    else
    {

        if (speed == NRF24L01_2MBPS)
        {   // Set RF_DR_HIGH to 1 (2Mbs)
            wide_band = true ;
            setup |= (1 << RF_DR_HIGH);
        }
        else
        {
            // 1Mbs
            wide_band = false;
        }
    }
    write_register(RF_SETUP,setup);

    // Verify result
    if (read_register(RF_SETUP) == setup)
    {
        result = true;
    }
    else
    {
        wide_band = false;
    }

    return result;
}

/**
 * Set Power Amplifier (PA) level to one of four levels.
 *
 * NRF24L01_PA_MIN=-18dBm, NRF24L01_PA_LOW=-12dBm,
 * NRF24L01_PA_MED=-6dBM, and NRF24L01_PA_HIGH=0dBm.
 *
 * @param level Desired PA level.
 */
void NRF24L01::set_pa_level(nrf24l01_pa_dbm level)
{
    uint8_t setup = read_register(RF_SETUP);
    setup &= ~((1 << RF_PWR_LOW) | (1 << RF_PWR_HIGH));

    if (level == NRF24L01_PA_MAX)
    {
        setup |= ((1 << RF_PWR_LOW) | (1 << RF_PWR_HIGH));
    }
    else if (level == NRF24L01_PA_HIGH)
    {
        setup |= (1 << RF_PWR_HIGH);
    }
    else if (level == NRF24L01_PA_LOW)
    {
        setup |= (1 << RF_PWR_LOW);
    }
    else if (level == NRF24L01_PA_MIN)
    {
        // Do nothing
    }
    else if (level == NRF24L01_PA_ERROR)
    {
        // If error, go to maximum PA
        setup |= ((1 << RF_PWR_LOW) | (1 << RF_PWR_HIGH));
    }

    write_register(RF_SETUP, setup);
}

/**
 * Set Static Payload Size
 *
 * If this method is never called, the driver will always
 * transmit the maximum payload size (32 bytes), no matter how much
 * was sent to write().
 *
 * @param size The number of bytes in the payload
 */
void NRF24L01::set_payload_size(uint8_t size)
{
    const uint8_t max_payload_size = 32;
    payload_size = min(size, max_payload_size);
}

/**
 * Set the number and delay of retries upon failed submit
 *
 * @param delay How long to wait between each retry, in multiples of 250us,
 * max is 15.  0 means 250us, 15 means 4000us.
 * @param count How many retries before giving up, max 15
 */
void NRF24L01::set_retries(uint8_t delay, uint8_t count)
{
    write_register(SETUP_RETR, (delay & 0xf)<<ARD | (count & 0xf)<<ARC);
}

/**
 * Start listening on the pipes opened for reading.
 *
 * Be sure to call open_reading_pipe() first.  Do not call write() while
 * in this mode, without first calling stop_listening().  Call
 * available() to check for incoming traffic, and read() to get it.
 */
void NRF24L01::start_listening(void)
{
    write_register(CONFIG, read_register(CONFIG) | (1 << PWR_UP) | (1 << PRIM_RX));
    write_register(STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));

