RossBerry/TM4C123GH6PM-nRF24L01/nrf24l01.cpp
    // Restore the pipe0 address, if it exists
    if (pipe0_reading_address)
    {
        write_register(RX_ADDR_P0, reinterpret_cast<const uint8_t*>(&pipe0_reading_address), 5);
    }

    // Flush buffers
    flush_rx();
    flush_tx();

    // Enable radio
    set_ce(HIGH);

    listening = true;

    // Wait for the radio to start up (130us actually only needed)
    delay_microseconds(130);
}

/**
 * Non-blocking write to the open writing pipe
 *
 * Just like write(), but it returns immediately.
 *
 * @see write()
 *
 * @param buf Pointer to the data to be sent
 * @param len Number of bytes to be sent
 * @return True if the payload was delivered successfully false if not
 */
void NRF24L01::start_write( const void* buf, uint8_t len )
{
    // Power-up transmitter
    write_register(CONFIG, (read_register(CONFIG) | (1 << PWR_UP) ) & ~(1 << PRIM_RX));
    delay_microseconds(150);

    // Send the payload
    write_payload(buf, len);

    // Enable radio and wait for payload to be transmitted
    set_ce(HIGH);
    delay_microseconds(15);

    // Disable radio
    set_ce(LOW);
}

/**
 * Stop listening for incoming messages
 *
 * Do this before calling write().
 */
void NRF24L01::stop_listening(void)
{
    set_ce(LOW);
    flush_tx();
    flush_rx();
}

/**
 * Test whether there was a carrier on the line for the
 * previous listening period.
 *
 * Useful to check for interference on the current channel.
 *
 * @return true if was carrier, false if not
 */
bool NRF24L01::test_carrier(void)
{
    return (read_register(CD) & 1);
}

/**
 * Test whether a signal (carrier or otherwise) greater than
 * or equal to -64dBm is present on the channel. Valid only
 * on nRF24L01P (+) hardware. On nRF24L01, use test_carrier().
 *
 * Useful to check for interference on the current channel and
 * channel hopping strategies.
 *
 * @return true if signal => -64dBm, false if not
 */
bool NRF24L01::test_rpd(void)
{
    return (read_register(RPD) & 1);
}

/**
 * Write to the open writing pipe
 *
 * Be sure to call open_writing_pipe() first to set the destination
 * of where to write to.
 *
 * This blocks until the message is successfully acknowledged by
 * the receiver or the timeout/retransmit limit is reached.  In
 * the current configuration, the max delay here is 60ms.
 *
 * The maximum size of data written is the fixed payload size, see
 * get_payload_size().  However, you can write less, and the remainder
 * will just be filled with zeroes.
 *
 * @param buf Pointer to the data to be sent
 * @param len Number of bytes to be sent
 * @return True if the payload was delivered successfully false if not
 */
bool NRF24L01::write(const void* buf, uint8_t len)
{
    // Begin the write
    start_write(buf, len);

    // Monitor the send
    uint8_t observe_tx;
    uint8_t status;
    uint32_t sent_at = get_runtime_milliseconds();
    const uint32_t timeout = 500; //ms to wait for timeout
    do
    {
        status = read_register(OBSERVE_TX, &observe_tx, 1);
    }
    while (!(status & ((1 << TX_DS) | (1 << MAX_RT)))
            && (get_runtime_milliseconds() - sent_at < timeout));

    // The status tells us three things
    // * The send was successful (TX_DS)
    // * The send failed, too many retries (MAX_RT)
    // * There is an ack packet waiting (RX_DR)
    // Update statuses
    bool tx_ok = status & (1 << TX_DS);
    bool tx_fail = status & (1 << MAX_RT);
    ack_payload_available = status & (1 << RX_DR);

    // Reset STATUS register if send failed
    if (tx_fail)
    {
        write_register(STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));
    }

    // Get size of ack payload if available
    if (ack_payload_available)
    {
        ack_payload_length = get_dynamic_payload_size();
    }

    // Power down
    power_down();

    // Flush buffers
    flush_tx();

    return tx_ok;
}

/**
 * Write an ack payload for the specified pipe
 *
 * The next time a message is received on @p pipe, the data in @p buf will
 * be sent back in the acknowledgement.
 *
 * @warning According to the data sheet, only three of these can be pending
 * at any time.
 *
 * @param pipe Which pipe# (typically 1-5) will get this response.
 * @param buf Pointer to data that is sent
 * @param len Length of the data to send, up to 32 bytes max.  Not affected
 * by the static payload set by set_payload_size().
 */
void NRF24L01::write_ack_payload(uint8_t pipe, const void* buf, uint8_t len)
{
    const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

    set_csn(LOW);
    spi_transfer(W_ACK_PAYLOAD | (pipe & 0x7));
    const uint8_t max_payload_size = 32;
    uint8_t data_len = min(len, max_payload_size);
    while (data_len--)
    {
        spi_transfer(*current);
    }
    set_csn(HIGH);
}
